[
    {
        "date": "2025-08-11",
        "topic": "Nigerian profitable food delivery Chowdeck lands $9M from Novastar, Y Combinator",
        "URL": "https://techcrunch.com/2025/08/11/nigeria-profitable-food-delivery-chowdeck-lands-9m-from-novastar-y-combinator/",
        "source": "Chowdeck\n, a Lagos-based food delivery startup that has stayed profitable in a\nnotoriously tough and low-margin market\n, has raised $9 million in Series A funding to launch a quick commerce strategy and expand into more cities in Nigeria and Ghana.\nThe equity round was led by Novastar Ventures, with participation from Y Combinator, AAIC Investment, Rebel Fund, GFR Fund, Kaleo, HoaQ, and others. The investors are betting on the team’s ability to pair local market expertise with execution and turn a notoriously difficult sector into a profitable super app for food, groceries and essentials.\n“We’re thrilled about this round as it brings us closer to our vision of becoming Africa’s number one super app,” CEO and co-founder\nFemi Aluko\nsaid. “This funding will supercharge our growth plans, enabling us to expand into more cities, reduce delivery times, scale our grocery footprint, and attract the best talent to drive innovation and customer satisfaction.”\nFounded in October 2021 by Aluko,\nOlumide Ojo\n, and\nLanre Yusuf\n, Chowdeck now operates in 11 cities across Nigeria and Ghana, serving 1.5 million customers with a network of more than 20,000 riders. Its logistics system averages 30 minutes per order, and in dense areas, more than half of deliveries arrive by bicycle.\nWhile prominent players have exited or scaled back their African operations, Chowdeck has leaned into the complexity of local markets—delivering local meals, an operationally harder challenge—to build trust with customers.\nIn 2024, the value of meals delivered through Chowdeck grew more than sixfold from the previous year. This year, the company says it passed its 2024 total before July.\nThe new funding will help Chowdeck roll out quick commerce, ultra-fast delivery backed by a network of dark stores and hyperlocal logistics hubs. The company plans to open 40 dark stores by the end of this year and 500 by the end of 2026, with two to three new stores launching each week. Chowdeck\nraised a $2.5 million\nseed round last year.\nTechcrunch event\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital, Elad Gil — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $600+ before prices rise.\nTech and VC heavyweights join the Disrupt 2025 agenda\nNetflix, ElevenLabs, Wayve, Sequoia Capital — just a few of the heavy hitters joining the Disrupt 2025 agenda. They’re here to deliver the insights that fuel startup growth and sharpen your edge. Don’t miss the 20th anniversary of TechCrunch Disrupt, and a chance to learn from the top voices in tech — grab your ticket now and save up to $675 before prices rise.\nSan Francisco\n|\nOctober 27-29, 2025\nREGISTER NOW\nImage Credits:\nChowdeck\nFood delivery is a crowded business globally, but when done well, it has led to some other big companies like\nDoorDash\n.\nQuick commerce, on the other hand, has been a capital-intensive gamble in most markets. In Europe,\nGorillas and Getir\nburned through hundreds of millions of dollars before retreating or consolidating. In India, platforms like\nBlinkit\n,\nZepto\nand\nSwiggy\nhave had varying levels of success with the model when it comes to profitability.\nChowdeck has been profitable since before this raise and Aluko says the company doesn’t enter cities or verticals without planning to break even within a couple of weeks.\nFor instance, the food delivery platform\nentered neighbouring Ghana this May\n. Within three months,\nit was handling 1,000 daily orders\nwithout paid advertising, which, according to Aluko, came from pent-up demand for a service that delivers local favorites alongside international cuisines. The company aims to quintuple that volume to 5,000 daily orders by the end of September 2025.\nAluko says Chowdeck plans to apply the same playbook to dark stores, which will complement its restaurant and grocery delivery operations.\nAnother vertical complementing these operations will be software. This June,\nthe YC-backed startup acquired Mira\n, a point-of-sale provider for African food and hospitality businesses. Mira’s tools manage inventory and orders in real time; now, it will help Chowdeck optimize its operations, positioning the company as a vertical SaaS-plus-logistics provider for restaurants.\nChowdeck’s raise is a win for local players in the sector,\nafter Jumia’s exit\nleft market share to foreign brands such as Glovo, Bolt Food, and Yango. Yet,\nsome of these companies\nhave also withdrawn\nfrom certain markets\n, including Nigeria and Ghana, which Chowdeck is now targeting aggressively.\nSuper apps such as Gozem, YC-backed\nYassir\n, and\nMNT-Halan\nare other local companies offering food delivery services in other African markets.\n“The market is still very early,” Aluko said. “Customer behavior is shifting online for the first time. A whole generation is growing up ordering food without ever having walked into some of the restaurants or markets on our platform.”\nFor lead investor Novastar Ventures, the bet is on execution and local insight. “Chowdeck is building the future of logistics for African cities,” said partner Brian Waswani Odhiambo. “With deep local insight, a sustainability-first approach, and impressive execution, it is redefining last-mile delivery on the continent.”\nNigeria’s YC-backed Chowdeck hopes to scale food delivery, a notoriously tough market, with $2.5M funding\nTopics\nAfrica\n,\nChowdeck\n,\nfood apps\n,\nfood delivery\n,\nnigeria food delivery\n,\nStartups\nTage Kene-Okafor\nReporter, Africa\nTage Kene-Okafor is a reporter at TechCrunch based in Lagos, Nigeria, covering the intersection of startups and venture capital in Africa. Tage reported on the same beat for Techpoint Africa.\nYou can contact or verify outreach from Tage by emailing\ntage.techcrunch@gmail.com\nor via encrypted message at +234 808 219 2449 on WhatsApp.\nView Bio\nOctober 27-29, 2025\nSan Francisco\nPut your brand in front of 10,000+ tech and VC leaders across all three days of Disrupt 2025. Amplify your reach, spark real connections, and lead the innovation charge. Secure your exhibit space before your competitor does.\nBook Your Table\nMost Popular\nSam Altman addresses ‘bumpy’ GPT-5 rollout, bringing 4o back, and the ‘chart crime’\nJulie Bort\nTesla shuts down Dojo, the AI training supercomputer that Musk said would be key to full self-driving\nRebecca Bellan\nThe backlash against Duolingo going ‘AI-first’ didn’t even matter\nAmanda Silberling\nKey sections of the US Constitution deleted from government’s website\nZack Whittaker\nDominic-Madori Davis\nInstagram takes on Snapchat with new ‘Instagram Map’\nAisha Malik\nGoogle says hackers stole its customers’ data by breaching its Salesforce database\nZack Whittaker\nThree weeks after acquiring Windsurf, Cognition offers staff the exit door\nRebecca Bellan"
    },
    {
        "date": "2025-08-11",
        "topic": "AI’s promise of opportunity masks a reality of managed displacement",
        "URL": "https://venturebeat.com/ai/ais-promise-of-opportunity-masks-a-reality-of-managed-displacement/",
        "source": "Want smarter insights in your inbox? Sign up for our weekly newsletters to get only what matters to enterprise AI, data, and security leaders.\nSubscribe Now\nCognitive migration is underway. The station is crowded. Some have boarded while others hesitate, unsure whether the destination justifies the departure.\nFuture of work expert and Harvard University Professor Christopher Stanton\ncommented\nrecently that the uptake of AI has been tremendous and observed that it is an “extraordinarily fast-diffusing technology.” That speed of adoption and impact is a critical part of what differentiates the AI revolution from previous technology-led transformations, like the PC and the internet. Demis Hassabis, CEO of Google DeepMind, went further,\npredicting\nthat AI could be “10 times bigger than the Industrial Revolution, and maybe 10 times faster.”\nIntelligence, or at least thinking, is increasingly shared between people and machines. Some people have begun to regularly use AI in their workflows. Others have gone further, integrating it into their cognitive routines and creative identities. These are the “\nwilling\n,” including the consultants fluent in prompt design, the product managers retooling systems and those building their own businesses that do everything from coding to product design to marketing.\nFor them, the terrain feels new but navigable. Exciting, even. But for many others, this moment feels strange, and more than a little unsettling. The risk they face is not just being left behind. It is not knowing how, when and whether to invest in AI, a future that seems highly uncertain, and one that is difficult to imagine their place in. That is the double risk of\nAI readiness\n, and it is reshaping how people interpret the pace, promises and pressure of this transition.\nAI Scaling Hits Its Limits\nPower caps, rising token costs, and inference delays are reshaping enterprise AI. Join our exclusive salon to discover how top teams are:\nTurning energy into a strategic advantage\nArchitecting efficient inference for real throughput gains\nUnlocking competitive ROI with sustainable AI systems\nSecure your spot to stay ahead\n:\nhttps://bit.ly/4mwGngO\nIs it real?\nAcross industries, new roles and teams are forming, and AI tools are reshaping workflows faster than norms or strategies can keep up. But the significance is still hazy, the strategies unclear. The end game, if there is one, remains uncertain. Yet the pace and scope of change feels portentous. Everyone is being told to adapt, but few know exactly what that means or how far the changes will go. Some AI industry leaders claim huge changes are coming, and soon, with\nsuperintelligent machines\nemerging possibly within a few years.\nBut maybe this AI revolution will go bust, as others have before, with another “\nAI winter\n” to follow. There have been two notable winters. The first was in the 1970s, brought about by computational limits. The second began in the late 1980s after a wave of unmet expectations with high-profile failures and under-delivery of “expert systems.” These winters were characterized by a cycle of lofty expectations followed by profound disappointment, leading to significant reductions in funding and interest in AI.\nShould the excitement around AI agents today mirror the failed promise of expert systems, this could lead to another winter. However, there are major differences between then and now. Today, there is far greater institutional buy-in, consumer traction and cloud computing infrastructure compared to the expert systems of the 1980s. There is no guarantee that a new winter will not emerge, but if the industry fails this time, it will not be for lack of money or momentum. It will be because trust and reliability broke first.\nA major retrenchment occurred in 1988 after the AI industry failed to meet its promises.\nThe New York Times\nCognitive migration has started\nIf “the great cognitive migration” is real, this remains the early part of the journey. Some have boarded the train while others still linger, unsure about whether or when to get onboard. Amidst the uncertainty, the atmosphere at the station has grown restless, like travelers sensing a trip itinerary change that no one has announced.\nMost people have jobs, but they wonder about the degree of risk they face. The value of their work is shifting. A quiet but mounting anxiety hums beneath the surface of performance reviews and company town halls.\nAlready, AI can\naccelerate\nsoftware development by 10 to 100X, generate the majority of client-facing code and compress project timelines dramatically. Managers are now able to use AI to create employee\nperformance evaluations\n. Even classicists and archaeologists have found value in AI, having used the technology to\nunderstand ancient Latin\ninscriptions.\nThe “willing” have an idea of where they are going and may find traction. But for the “pressured,” the “resistant” and even those not yet touched by AI, this moment feels like something between anticipation and grief. These groups have started to grasp that they may not be staying in their comfort zones for long.\nFor many, this is not just about tools or a new culture, but whether that culture has space for them at all. Waiting too long is akin to missing the train and could lead to long-term job displacement. Even those I have spoken with who are senior in their careers and have begun using AI wonder if their positions are threatened.\nThe narrative of opportunity and upskilling hides a more uncomfortable truth. For many, this is not a migration. It is a managed displacement. Some workers are not choosing to opt out of AI. They are discovering that the future being built does not include them. Belief in the tools is different from belonging in the system tools are reshaping. And without a clear path to participate meaningfully, “adapt or be left behind” begins to sound less like advice and more like a verdict.\nThese tensions are precisely why this moment matters. There is a growing sense that work, as they have known it, is beginning to recede. The signals are coming from the top. Microsoft CEO Satya Nadella acknowledged as much in a July 2025\nmemo\nfollowing a reduction in force, noting that the transition to the AI era “might feel messy at times, but transformation always is.” But there is another layer to this unsettling reality: The technology driving this urgent transformation remains fundamentally unreliable.\nThe power and the glitch: Why AI still cannot be trusted\nAnd yet, for all the urgency and momentum, this\nincreasingly pervasive technology\nitself remains glitchy, limited, strangely brittle and far from dependable. This raises a second layer of doubt, not only about how to adapt, but about whether the tools we are adapting to can deliver. Perhaps these shortcomings should not be a surprise, considering that it was only several years ago when the output from large language models (LLMs) was barely coherent. Now, however, it is like having a PhD in your pocket; the idea of on-demand\nambient intelligence\nonce science fiction almost realized.\nBeneath their polish, however, chatbots built atop these LLMs remain fallible, forgetful and often overconfident. They still hallucinate, meaning that we cannot entirely trust their output. AI can answer with confidence, but not accountability. This is probably a good thing, as our knowledge and expertise are still needed. They also do not have persistent memory and have difficulty carrying forward a conversation from one session to another.\nThey can also get lost. Recently, I had a session with a leading chatbot, and it answered a question with a complete non-sequitur. When I pointed this out, it responded again off-topic, as if the thread of our conversation had simply vanished.\nThey also do not learn, at least not in any human sense. Once a model is released, whether by Google, Anthropic, OpenAI or\nDeepSeek\n, its weights are frozen. Its “intelligence” is fixed. Instead, continuity of a conversation with a chatbot is limited to the confines of its context window, which is, admittedly, quite large. Within that window and conversation, the chatbots can absorb knowledge and make connections that serve as learning in the moment, and they appear increasingly like savants.\nThese gifts and flaws add up to an intriguing, beguiling presence. But can we trust it? Surveys such as the 2025\nEdelman Trust Barometer\nshow that AI trust is divided. In China, 72% of people express trust in AI. But in the U.S., that number drops to 32%. This divergence underscores how public faith in AI is shaped as much by culture and governance as by technical capability. If AI did not hallucinate, if it could remember, if it learned, if we understood how it worked, we would likely trust it more. But trust in the AI industry itself remains elusive. There are widespread fears that there will be no meaningful regulation of AI technology, and that ordinary people will have little say in how it is developed or deployed.\nWithout trust, will this AI revolution flounder and bring about another winter? And if so, what happens to those who have invested time, energy and their careers? Will those who have waited to embrace AI be better off for having done so? Will cognitive migration be a flop?\nSome notable AI researchers have warned that AI in its current form — based primarily on deep learning neural networks upon which LLMs are built — will fall short of optimistic projections. They claim that additional technical breakthroughs will be needed for this approach to advance much further. Others do not buy into the optimistic AI projections.\nNovelist Ewan Morrison\nviews the potential of superintelligence as a fiction dangled to\nattract investor funding\n. “It’s a fantasy,” he said, “a product of venture capital gone nuts.”\nPerhaps Morrison’s skepticism is warranted. However, even with their shortcomings, today’s LLMs are already demonstrating huge commercial utility. If the exponential progress of the last few years stops tomorrow, the ripples from what has already been created will have an impact for years to come. But beneath this movement lies something more fragile: The reliability of the tools themselves.\nThe gamble and the dream\nFor now, exponential advances continue as companies pilot and increasingly deploy AI. Whether driven by conviction or fear of missing out, the industry is determined to move forward. It could all fall apart if another winter arrives, especially if AI agents fail to deliver. Still, the prevailing assumption is that today’s shortcomings will be solved through better software engineering. And they might be. In fact, they probably will, at least to a degree.\nThe bet is that the technology will work, that it will scale and that the disruption it creates will be outweighed by the productivity it enables. Success in this adventure assumes that what we lose in human nuance, value and meaning will be made up for in reach and efficiency. This is the gamble we are making. And then there is the dream: AI will become a source of abundance widely shared, will elevate rather than exclude, and expand access to intelligence and opportunity rather than concentrate it.\nThe unsettling lies in the gap between the two. We are moving forward as if taking this gamble will guarantee the dream. It is the hope that acceleration will land us in a better place, and the faith that it will not erode the human elements that make the destination worth reaching. But history reminds us that even successful bets can leave many behind. The “messy” transformation now underway is not just an inevitable side effect. It is the direct result of speed overwhelming human and institutional capacity to adapt effectively and with care. For now, cognitive migration continues, as much on faith as belief.\nThe challenge is not just to build better tools, but to ask harder questions about where they are taking us. We are not just migrating to an unknown destination; we are doing it so fast that the map is changing while we run, moving across a landscape that is still being drawn. Every migration carries hope. But hope, unexamined, can be risky. It is time to ask not just where we are going, but who will get to belong when we arrive.\nGary Grossman is EVP of technology practice at\nEdelman\nand global lead of the Edelman AI Center of Excellence.\nDaily insights on business use cases with VB Daily\nIf you want to impress your boss, VB Daily has you covered. We give you the inside scoop on what companies are doing with generative AI, from regulatory shifts to practical deployments, so you can share insights for maximum ROI.\nSubscribe Now\nRead our\nPrivacy Policy\nThanks for subscribing. Check out more\nVB newsletters here\n.\nAn error occured."
    },
    {
        "date": "2025-08-11",
        "topic": "NASA plans to build a nuclear reactor on the Moon—a space lawyer explains why",
        "URL": "https://arstechnica.com/space/2025/08/nasa-plans-to-build-a-nuclear-reactor-on-the-moon-a-space-lawyer-explains-why/",
        "source": "No one can own the Moon\nNASA plans to build a nuclear reactor on the Moon—a space lawyer explains why\nNuclear power could be the linchpin for long-term human activity.\nMichelle L.D. Hanlon, The Conversation\n–\nAug 10, 2025 7:05 am\n|\n148\nCredit:\n\n          \n          NASA\nCredit:\n\n          \n          NASA\nText\n        settings\nStory text\nSize\nSmall\nStandard\nLarge\nWidth\n*\nStandard\nWide\nLinks\nStandard\nOrange\n* Subscribers only\nLearn more\nMinimize to nav\nThe first space race was about flags and footprints. Now, decades later,\nlanding on the Moon\nis old news. The new race is to build there, and doing so hinges on power.\nIn April 2025,\nChina reportedly\nunveiled plans to build a nuclear power plant on the Moon by 2035. This plant would support its planned\ninternational lunar research station\n. The\nUnited States countered\nin August, when acting NASA Administrator Sean Duffy reportedly\nsuggested a US reactor\nwould be operational on the Moon by 2030.\nWhile it might feel like a sudden sprint, this isn’t exactly breaking news. NASA and the Department of Energy have spent years quietly developing\nsmall nuclear power systems\nto power lunar bases, mining operations, and long-term habitats.\nAs a space lawyer\nfocused on long-term human advancement into space, I see this not as an arms race but as a strategic infrastructure race. And in this case, infrastructure is influence.\nA lunar nuclear reactor may sound dramatic, but it's neither illegal nor unprecedented. If deployed responsibly, it could allow countries to peacefully explore the Moon, fuel their economic growth, and test technologies for deeper space missions. But building a reactor also raises critical questions about access and power.\nThe legal framework already exists\nNuclear power in space\nisn’t a new idea. Since the 1960s, the US and the Soviet Union have relied on\nradioisotope generators\nthat use small amounts of radioactive elements—a type of nuclear fuel—\nto power satellites\n, Mars rovers, and the Voyager probes.\nThe United Nations’ 1992\nPrinciples Relevant to the Use of Nuclear Power Sources in Outer Space\n, a nonbinding resolution, recognizes that nuclear energy may be essential for missions where solar power is insufficient. This resolution sets guidelines for safety, transparency, and international consultation.\nNothing in international law prohibits the peaceful use of nuclear power on the Moon. But what matters is how countries deploy it. And the first country to succeed could shape the norms for expectations, behaviors, and legal interpretations related to lunar presence and influence.\nWhy being first matters\nThe\n1967 Outer Space Treaty\n, ratified by all major spacefaring nations including the US, China, and Russia,\ngoverns space activity\n. Its\nArticle IX\nrequires that states act with “due regard to the corresponding interests of all other States Parties.”\nThat statement means if one country places a nuclear reactor on the Moon, others must\nnavigate around it\n, legally and physically. In effect, it draws a line on the lunar map. If the reactor anchors a larger, long-term facility, it could quietly shape what countries do and how their moves are interpreted legally, on the Moon and beyond.\nOther articles in the Outer Space Treaty set similar boundaries on behavior, even as they encourage cooperation. They affirm that all countries have the right to freely explore and access the Moon and other celestial bodies, but they\nexplicitly prohibit territorial claims\nor assertions of sovereignty.\nAt the same time, the treaty acknowledges that countries may establish installations such as bases—and with that, gain the power to limit access. While visits by other countries are encouraged as a transparency measure, they must be preceded by prior consultations. Effectively, this grants operators a degree of control over who can enter and when.\nBuilding infrastructure is not staking a territorial claim. No one can own the Moon, but one country setting up a reactor could shape where and how others operate—functionally, if not legally.\nInfrastructure is influence\nBuilding a nuclear reactor establishes a country’s presence in a given area. This idea is especially important for resource-rich areas such as the lunar south pole,\nwhere ice\nfound in perpetually shadowed craters could fuel rockets and sustain lunar bases.\nThese sought-after regions are\nscientifically vital\nand geopolitically sensitive, as multiple countries want to build bases or conduct research there. Building infrastructure in these areas would cement a country’s ability to access the resources there and potentially exclude others from doing the same.\nCritics may worry about radiation risks. Even if designed for peaceful use and contained properly, reactors introduce new environmental and operational hazards, particularly in a dangerous setting such as space. But the UN guidelines do outline rigorous safety protocols, and following them could potentially mitigate these concerns.\nWhy nuclear? Because solar has limits\nThe Moon has\nlittle atmosphere\nand experiences\n14-day stretches of darkness\n. In some shadowed craters, where ice is likely to be found, sunlight never reaches the surface at all. These issues make solar energy unreliable, if not impossible, in some of the most critical regions.\nA\nsmall lunar reactor\ncould operate continuously for a decade or more, powering habitats, rovers,\n3D printers\n, and\nlife-support systems\n. Nuclear power could be the linchpin for long-term human activity. And it’s not just about the Moon – developing this capability is essential for missions to Mars, where solar power is even more constrained.\nThe UN Committee on the Peaceful Uses of Outer Space sets guidelines to govern how countries act in outer space. United States Mission to International Organizations in Vienna.\nCredit:\nCC BY-NC-ND\nA call for governance, not alarm\nThe United States has an opportunity to lead not just in technology but in governance. If it commits to sharing its plans publicly, following Article IX of the Outer Space Treaty and reaffirming a commitment to peaceful use and international participation, it will encourage other countries to do the same.\nThe future of the Moon won’t be determined by who plants the most flags. It will be determined by who builds what, and how. Nuclear power may be essential for that future. Building transparently and in line with international guidelines would allow countries to more safely realize that future.\nA reactor on the Moon isn’t a territorial claim or a declaration of war. But it is infrastructure. And infrastructure will be how countries display power—of all kinds—in the next era of space exploration.\nMichelle L.D. Hanlon\n, Professor of Air and Space Law,\nUniversity of Mississippi\n.\nThis article is republished from\nThe Conversation\nunder a Creative Commons license. Read the\noriginal article\n.\nThe Conversation\nThe Conversation\nThe Conversation is an independent source of news and views, sourced from the academic and research community. Our team of editors work with these experts to share their knowledge with the wider public. Our aim is to allow for better understanding of current affairs and complex issues, and hopefully improve the quality of public discourse on them.\n148 Comments"
    },
    {
        "date": "2025-08-11",
        "topic": "Don't stop at basic protections; make ongoing training a priority",
        "URL": "https://www.techradar.com/pro/dont-stop-at-basic-protections-make-ongoing-training-a-priority",
        "source": "Pro\nDon't stop at basic protections; make ongoing training a priority\nOpinion\nBy\nAndy Syrewicze\npublished\n11 August 2025\nAs technology evolves at a rapid pace, companies must keep up with advancements made by cyber-attackers\nComments\n(0)\n(\n)\nWhen you purchase through links on our site, we may earn an affiliate commission.\nHere’s how it works\n.\n(Image credit: Shutterstock)\nFifty years ago, it was heists like the one that hit the Baker Street Bank that had the power to shock the nation. Now, in the digital world, heists look starkly different and\ncybersecurity\nthreats are constant, with banks like NatWest facing a “continuous arms race” with around 100 million cyber-attacks every month. What used to be gangs of robbers digging tunnels and smuggling deposit boxes full of cash are now groups of hackers sending phishing emails and holding some of the most notable companies to ransom for hundreds of millions of dollars.\nThis transition from physical to digital theft is evident. No longer confined to vaults and getaway cars, today's high-stake heists are executed remotely, by online threat actors. These modern-day criminals operate across borders, targeting vulnerabilities in systems and human behavior to extract data and money. The sheer volume and relentless nature of these digital assaults, as exemplified by financial institutions battling millions of cyber-attacks monthly, highlight a new era of crime.\nAndy Syrewicze\nSocial Links Navigation\nSecurity Evangelist at Hornetsecurity.\nThe growing problem of cyber-attacks\nCyber-attacks are a growing problem, amongst a growing number of sectors, and confronting this escalating issue is vital. It’s not just banks that are facing the constant threat of cyber-attacks; cyber threats are growing at an exponential rate, while becoming increasingly sophisticated and targeted.\nYou may like\nWhy burnout is one of the biggest threats to your security\nThe Human Firewall: even with AI, humans are still the last line of defense in cybersecurity\nSMBs remain easy pickings for cybercriminals - here’s why\nData breaches have hit a myriad of industries: from luxury brands like Dior and supermarkets like M&S, to cryptocurrency exchange Coinbase and UK government organization Legal Aid.\nThe dangers to personal data are being felt across all sectors, at all digital touchpoints. Amid this battleground of immediate cyber threats comes a growing demand for robust\nsecurity\nsolutions that address company concerns.\nFrom advanced\nantivirus\ntechnologies to endpoint\nbackup software\n, AI-powered security is evolving rapidly to stay ahead of such attacks - and it’s essential that companies invest in these defenses in order to stay more than one step ahead.\nEvolution of technology\nAs technology evolves at a rapid pace, companies must keep up with advancements made by cyber-attackers. As businesses of all sizes continue to embrace digital transformation, the need to strengthen their cybersecurity grows increasingly critical.\nAre you a pro? Subscribe to our newsletter\nSign up to the TechRadar Pro newsletter to get all the top news, opinion, features and guidance your business needs to succeed!\nContact me with news and offers from other Future brands\nReceive email from us on behalf of our trusted partners or sponsors\nBy submitting your information you agree to the\nTerms & Conditions\nand\nPrivacy Policy\nand are aged 16 or over.\nThe UK Government’s recently published Cyber Governance Code of Practice highlights that\nmanagement\nof cyber risks is vital for modern businesses to function, and effective management requires collective input from across an organization. This Code of Practice and governance framework package guides boards and directors in managing digital risks and safeguarding their businesses and organizations from cyberattacks.\nThe framework encourages companies to take four employee-focused actions: foster a cybersecurity culture; ensure clear policies support a positive cybersecurity culture; improve their own cyber literacy through training; and use suitable metrics to verify the organization has an effective cybersecurity training, education, and awareness program.\nThe report is a clear reminder that the human\nfirewall\n, that is, the employees who encounter an attack and respond, is just as important as technological defenses.\nMore than a simple fix, a culture shift is needed\nIt’s not enough to roll out generic training. The reality is that in today’s world, one wrong click can bring a business to a complete halt. According to the latest insights, the approximate amount of ransoms paid globally in 2024 reached $813.55 million.\nWhen requested to pay a ransom, companies know that refusing to do so runs the risk of their customers’ personal information being leaked publicly, which would additionally require them to pay the associated financial penalties and legal payouts, not to mention reputational damage.\nAddressing the threat of cyber-attacks must be embedded in a company’s culture, given the fact that if threat actors are successful, the impact of their actions would be felt not only company-wide but also by the ecosystem within which the organization operates.\nLeadership and security\nOrganizations can bolster their security by cultivating strong leadership, providing tailored training, and building a proactive security culture to create a ‘human firewall’ of colleagues armed with know-how.\nEmployees\nof all skillsets and seniorities should undergo comprehensive and ongoing cyber awareness training, whatever their role and seniority, to drive the defenses forward and cultivate a mindful culture.\nWhen employees are provided with the knowledge and tools to maintain awareness of the dangers their company is facing, they can be the most effective method to keep the business secure.\nBuilding a mindful culture\nBuilding a mindful culture can be complemented by a Zero Trust approach, which creates a robust defense against evolving cyber threats. This strategic approach mandates rigorous verification for all access requests, irrespective of their origin or the user's location within the network, thereby yielding exceptionally strong results that effectively eliminate a significant portion of potential threats.\nFor example, when an employee receives an email requesting sensitive information or a link to a suspicious\nwebsite\n, they should be trained to recognize it as a potential phishing attempt right away, verify the sender's identity, and report the email to the IT department for further investigation.\nThis proactive stance, ingrained through a Zero Trust philosophy and continuous education, significantly reduces the likelihood of successful breaches. It’s better safe than sorry, and in the realm of cybersecurity, this means being diligent about taking the extra steps to fortify an organization's digital defenses.\nDon't stop at basic protections\nDon't stop at basic protections, make ongoing training a priority. Defenses can’t stop at antivirus technology and\nendpoint protection\n, and training isn’t a one-time solution. While these are the necessities, they are simply not enough for the twenty-first century heist as businesses continue to battle millions of cyber-attacks each month.\nAs threats advance or teams become complacent, ongoing phishing simulations, tests and education are key in maintaining a robust human firewall. Companies must invest in technology and ongoing training to equip employees across all roles and levels with the skills and awareness to stay alert. A company’s greatest weapon can be its workforce, if leveraged.\nCybersecurity needs tech, but it's nothing without people who are well trained to understand the latest attack methods and protect against the digital transition's inherent risks.\nWe list the best ransomware protection\n.\nThis article was produced as part of TechRadarPro's Expert Insights channel where we feature the best and brightest minds in the technology industry today. The views expressed here are those of the author and are not necessarily those of TechRadarPro or Future plc. If you are interested in contributing find out more here:\nhttps://www.techradar.com/news/submit-your-story-to-techradar-pro\nTOPICS\nAI\nAndy Syrewicze\nSocial Links Navigation\nSecurity Evangelist at Hornetsecurity.\nYou must confirm your public display name before commenting\nPlease logout and then login again, you will then be prompted to enter your display name.\nLogout\nRead more\nWhy burnout is one of the biggest threats to your security\nThe Human Firewall: even with AI, humans are still the last line of defense in cybersecurity\nSMBs remain easy pickings for cybercriminals - here’s why\nSecuring the future: why cybersecurity must be secure by design – and by default\nM&S, Co-Op and Harrods got hit by a cyberattack: here's what retailers need to do to stop this\nDigital fortress or open vault? Community banks on the cybersecurity front lines\nLatest in Pro\nOpen-source AI is central to safe development and deployment\nLTX Studio AI video production review\n“Speed is everything” - how Arm and Aston Martin’s new wind tunnel venture looks to bring in a new era of success\nThe Age of Agency: why Agentic AI will redefine the future of work\nHow enterprises can transition their knowledge and systems for Agentic AI\nUS government says BlackSuit and Royal ransomware gangs hit hundreds of major firms before shutdown\nLatest in Opinion\nOpen-source AI is central to safe development and deployment\nThe Age of Agency: why Agentic AI will redefine the future of work\nHow enterprises can transition their knowledge and systems for Agentic AI\nEmbracing the AI future\nI am a robotic expert and here are 5 things you should do about autonomous mobile robots\nWhy enterprises can’t afford to ignore cloud optimization in 2025\nLATEST ARTICLES\n1\nNot so smart anymore - researchers hack into a Gemini-powered smart home by hijacking...Google Calendar?\n2\nGMKtec EVO-T1 mini PC review\n3\n3D printing and AI will bring in 'new era of nuclear construction' - but how safe is it?\n4\nThe protagonist of Wednesday season 2 has psychic powers but we don’t – here are 5 big clues about what might be coming next\n5\nFresh Google Pixel Watch 4 leaks may give us our best look yet at the upgraded sensors and charging system"
    },
    {
        "date": "2025-08-11",
        "topic": "7 password managers to help keep your apps safe",
        "URL": "https://www.theverge.com/tech/712968/7-password-managers-to-help-keep-your-apps-safe",
        "source": "Tech\nClose\nTech\nPosts from this topic will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All\nTech\nReport\nClose\nReport\nPosts from this topic will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All\nReport\nApps\nClose\nApps\nPosts from this topic will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All\nApps\n7 password managers to help keep your apps safe\nIf you’re feeling like you want to move to a secure password manager, here are some possibilities.\nIf you’re feeling like you want to move to a secure password manager, here are some possibilities.\nby\nBarbara Krasnoff\nClose\nBarbara Krasnoff\nReviews Editor\nPosts from this author will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All by\nBarbara Krasnoff\nAug 10, 2025, 3:00 PM UTC\nLink\nFacebook\nThreads\nIf you buy something from a Verge link, Vox Media may earn a commission.\nSee our ethics statement.\nIllustration by Alex Castro / The Verge\nBarbara Krasnoff\nClose\nBarbara Krasnoff\nPosts from this author will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All by\nBarbara Krasnoff\nis a reviews editor who manages how-tos and various projects. She’s worked as an editor and writer (and occasional sci-fi author) for more years than she cares to admit to.\nPasswords still seem to be the most popular method of ensuring that the right person is using the right app or service, despite the slow adoption of\npasskeys\n, which are considered more secure. And because we should be using different ones for each device and/or app, the best way to track all of them is to use a password manager.\nSome apps and operating systems come with their own password managers. For example, if you’re part of the Apple ecosystem, you can use\niCloud Keychain\n; Google users have\nGoogle Password Manager\n, and Microsoft devices store passwords through its\nEdge browser\nand\nCredential Manager\n. Some apps that offer their own password managers (although at least one, Dropbox, recently announced that it was\nshutting down that service\n).\nThere are advantages to using an independent password manager. You aren’t limited to a single operating system or browser, and most of these apps offer a variety of other services. They not only save your passwords and drop them into apps when needed, but they generate new (and safer) passwords; save data such as credit card, contact info, and important files; share passwords with friends and family members; and alert you if a password has been part of a breach.\nSo, if you’d rather use an independent password manager, here are a few that are currently available.\nIn this article\nBitwarden\nDashlane\n1Password\nLogMeOnce\nNordPass\nKeeper\nLastPass\nBitwarden\nBitwarden offers a solid range of features and is completely free.\nImage: Bitwarden\nBitwarden is a well-known open-source password manager that offers a solid selection of features, including saving unlimited items, syncing across devices, and password generation. Unlike most of the other services listed here, almost all of its features are free. There are vaults for a variety of other data, such as credit cards, identity data, and\nSSH keys\n. You can also share files and data using end-to-end encryption. For no-cost day-to-day password usage, Bitwarden is a good choice.\nYou can find information on its security strategies\nhere\n.\nOther pricing\n:\nFor $10 a year, a Premium account gives you access to an integrated authenticator, the ability to add file attachments, and receive security reports. For $40 a year, the Family account lets you share vault items with up to five other users (rather than one), share passwords and other data with an unlimited number of people, and store unlimited collections.\nDashlane\nDashlane’s limited free version lets you store and autofill up to 25 passwords.\nImage: Dashlane\nDashlane, like Bitwarden, offers password generation, along with the ability to save credit card and other personal information, notes, and IDs. It also provides features such as secure sharing, phishing alerts, and includes a VPN. There is a limited free version that lets you store and autofill up to 25 passwords, but since most of us have more passwords than that, the best way to try it is to take advantage of the 30-day free trial.\nYou can find information on its security strategies\nhere\n.\nOther pricing\n:\nThe Premium plan (which is actually the basic plan for personal use) costs $59.88 a year, while the Friends & Family plan offers password management for up to 10 people for $89.88 a year.\n1Password\n1Password is a well-known password manager that with a clear, easy to understand interface.\nImage: 1Password\n1Password includes secure places to save documents, notes, and IDs; it flags data breaches and weak passwords; and lets you safely share items with others. There are also some interesting new features, such as the ability to\nadd a location to items\nso that they will appear in a Nearby tab, making them easier to find. It has a 14-day free trial.\nYou can find information on its security strategies\nhere\n.\nOther pricing\n:\nThe Individual plan costs $3.99 a month or $35.88 a year. The Family plan, which lets you include up to five family members, is $6.95 a month or $59.88 a year.\nLogMeOnce\nLogMeOnce allows you to categorize your passwords; it boasts “passwordless password management” using QR codes.\nImage: LogMeOnce\nLogMeOnce’s website talks about “Passwordless Password Management,” which it accomplishes using a system of QR codes. Its free Premium version provides unlimited passwords and use on unlimited devices, along with autofill, sync, password generation, 1MB of encrypted file storage, and two-factor authentication using email or Google Authenticator. You can also save up to three notes and three credit cards. LogMeOnce uses ads to fund its free version, so that could be a setback depending on your tolerance for advertising.\nYou can find information on its security strategies\nhere\n.\nOther pricing\n:\nThe Professional version adds 1GB of encrypted file storage, emergency access, additional authentication methods, and more for $2.50 a month. The Ultimate plan, $3.25 a month, adds 10GB of storage, unlimited note storage, password sharing, and a customizable dashboard, among other features. And for $4.99 a month, the Family plan lets six family members use LogMeOnce.\nNordPass\nLike many of its peers, NordPass offer the ability to save credit card and other personal info. (Blacked-out section done manually.)\nImage: NordPass\nThe free version of NordPass includes unlimited passwords and multifactor authentication. Most other features — cross-platform compatibility, the ability to protect documents and file attachments, checking password health, data breach alerts, the ability to mask your email address, and secure sharing, among others — are only available with the paid Premium account, which you can try with a 30-day trial.\nYou can find information on its security strategies\nhere\n.\nOther pricing\n:\nThe Premium version of NordPass costs $1.99 a month or $23.88 for the first year and $35.88 after that. The Family plan, which gives you six Premium user accounts, costs $3.69 a month or $44.28 for the first year and $71.88 after that.\nKeeper\nKeeper’s vault can handle passwords, attachments, and a self-destruct feature.\nImage: Keeper\nLike several of the other apps mentioned here, Keeper has a free version, but one that won’t suit most people for long. In this case, you are limited to one mobile device, ten passwords or passkeys, and two-factor authentication. However, a 30-day free trial gives you unlimited password storage across devices, password sharing, and identity and payment storage, along with biometric logins and customer support.\nYou can find information on its security strategies\nhere\n.\nOther pricing:\nKeeper Unlimited (aptly named) costs $39.99 a year; Keeper Family, which includes five private data vaults and 10GB file storage, costs $84.99 a year.\nLastPass\nLassPass now has a free version, but you can also take advantage of the 30-day free trial.\nLastPass has had\na lot of setbacks\nover the last few years, including a couple of serious breaches in 2022. Since then, it has worked to improve its service and its reputation.\nThere’s a free version that includes a password vault, access on a single device type (in other words, only computer or mobile), a password generator, and a service that monitors the internet for security breaches, which is not often included with free versions, among other features. A Premium version lets you use it with more than one device type. You can check it out with a 30-day free trial.\nYou can find information on its security strategies\nhere\n.\nOther pricing:\nthe Premium version costs $36 a year; the Family version, which includes six accounts, costs $48 a year.\nFollow topics and authors\nfrom this story to see more like this in your personalized homepage feed and to receive email updates.\nBarbara Krasnoff\nClose\nBarbara Krasnoff\nReviews Editor\nPosts from this author will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All by\nBarbara Krasnoff\nApps\nClose\nApps\nPosts from this topic will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All\nApps\nReport\nClose\nReport\nPosts from this topic will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All\nReport\nRoundup\nClose\nRoundup\nPosts from this topic will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All\nRoundup\nSecurity\nClose\nSecurity\nPosts from this topic will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All\nSecurity\nTech\nClose\nTech\nPosts from this topic will be added to your daily email digest and your homepage feed.\nPlus\nFollow\nSee All\nTech\nMost Popular\nMost Popular\nSex is getting scrubbed from the internet, but a billionaire can sell you AI nudes\nDitching my phone for an LTE smartwatch was a humbling experience\nGrok’s ‘spicy’ video setting instantly made me Taylor Swift nude deepfakes\nI went camping in a heat dome, and these five gadgets saved my vacation\nWe found stuff AI is pretty good at\nThe Verge Daily\nA free daily digest of the news that matters most.\nEmail (required)\nSign Up\nBy submitting your email, you agree to our\nTerms\nand\nPrivacy Notice\n.\nThis site is protected by reCAPTCHA and the Google\nPrivacy Policy\nand\nTerms of Service\napply.\nAdvertiser Content From\nThis is the title for the native ad"
    },
    {
        "date": "2025-08-11",
        "topic": "The best Nintendo Switch 2 games for 2025",
        "URL": "https://www.engadget.com/gaming/nintendo/best-nintendo-switch-2-games-070007467.html?src=rss",
        "source": "Why you can trust us\nEngadget has been testing and reviewing consumer tech since 2004. Our stories may include affiliate links; if you buy something through a link, we may earn a commission.\nRead more about how we evaluate products\n.\nGaming\nNintendo\nThe best Nintendo Switch 2 games for 2025\nLoad up your new console with excellent games for all kinds of players.\nEngadget\nFollow\nMon, August 11, 2025 at 7:00 AM UTC\n(Sam Rutherford for Engadget)\nThe Nintendo Switch 2 didn’t come out of the gate with a host of exclusive, must-play games. But we’re a few months into the console’s lifecycle now and there are a variety of Switch 2-only games that are worth your cash, as well as a bunch of original Switch games that have received improvements for the new console And there’s also a robust selection of third-party games that have been on other consoles for a while, but not available on the Switch.\nBetween all those, there are plenty of good games for the Switch 2 — and if you don’t have an original Switch, there’s even more out there. You can see\nour list of our favorite Switch games here\n, but this list will focus on Switch 2 exclusives, original Switch games that have been improved for the new hardware and the best-performing, third-party titles worth your time. And keep an eye on this list, as there should be a lot more Switch 2 exclusives coming this fall that we're excited to try, including eagerly-awaited titles like\nMetroid Prime 4\n.\nQuick Overview\nSwitch 2 exclusive\nMario Kart World\nMore options\n$79 at Amazon\nSwitch 2 exclusive\nDonkey Kong Bananza\nMore options\n$67 at Amazon\nThe Legend of Zelda: Breath of the Wild — Switch 2 edition\nMore options\n$69 at Amazon\nThe Legend of Zelda: Tears of the Kingdom — Switch 2 edition\nMore options\n$79 at Amazon\nFast Fusion\n$15 at GameStop\nSee 4 more\nBest Nintendo Switch 2 games for 2025\nNintendo\nSwitch 2 exclusive\nMario Kart World\nMario Kart World\nisn’t quite the\nreinvention\nof the massively popular franchise that I thought it might be based on Nintendo’s extensive preview of the game. No matter. Mario Kart is a proven formula, and Nintendo has done more than enough to make\nMKW\nthe kind of game that millions of people will play over the next decade or so. There are a ton of cleverly-designed new tracks that you can pick up and play immediately — but the more time you put into them, the more shortcuts and secrets you’ll find to help master them. There’s a truckload of Nintendo characters to pilot your kart or bike, from the heavy hitters to bizarre but amusing choices like a Piranha plant. And there are beefed-up multiplayer and sharing features powered by GameChat on the Switch 2.\nBut while\nMario Kart World\nwill feel familiar to the millions who played\nMario Kart 8\n, it also introduces a few noteworthy new features. One is that the majority of courses don’t have you doing three laps around a track — instead, you’re driving from point A to point B, with every track being set in a part of a larger world (hence the name). And there’s an open-world mode where you’re not in a race. You can cruise from one side of the map to the other, looking for little bonus challenges, unlocking more outfits for your characters and finding other collectibles. There are hundreds of P-Switch challenges and dozens of Peach medallions and question mark boxes you can track down. The fact that you can’t cruise around free roam in multiplayer mode is a major bummer, and the world itself feels somewhat deserted as a result, but there’s still a ton to do here.\nThe open-world nature of the game also enables a new race type: Knockout mode. This is probably my favorite part — it’s an ongoing race across six courses with five checkpoints along the way. At each checkpoint, you have to be higher than a certain ranking or you’ll be eliminated. Being in the top 20 out of 24 total racers at the first checkpoint isn’t so tough, but obviously the challenge grows as the field is trimmed. Knockout mode is a great combo of a more traditional Grand Prix style race with a longer, world-crossing sprint to the finish. While I wish Nintendo took just a few more risks with\nMario Kart World,\nit’s the kind of game anyone can pick up and have a blast with.\n— Nathan Ingraham, Deputy Editor\n$79 at Amazon\nExplore More Buying Options\n$80 at Macy's\n$80 at Target\nNintendo\nSwitch 2 exclusive\nDonkey Kong Bananza\nNintendo hasn’t made a 3D Donkey Kong platformer since 1999, but\nDonkey Kong Bananza\nis\nmore than worth the wait\n. I’d argue that it’s the first must-buy title for the Switch 2 and the most compelling reason to buy Nintendo’s latest console as soon as you can. It takes a delightful gaming mechanic (smashing nearly everything you can get your fists on) and builds a huge variety of engaging experiences around it. At first, I was worried I’d get tired of all the smashing, but the wide variety of different worlds and challenges keep things continuously fresh. The Bananza powers you pick up throughout the game definitely help with that, too — you can power up DK so his smashes are more potent, or transform into a speedy zebra to dash through obstacles or an ostrich that can float above them.\nThere’s also more story to the game than I expected, centering on DK and the 13-year-old girl Pauline who accompanies him through most of his adventures. She’s a charming sidekick and her love of singing is what helps DK unlock the aforementioned Bananza powers. The game is also absolutely gorgeous and visually stunning, with each world having a completely different vibe from the one that came before it — but they’re all wonderfully rendered. The music rules, too. Pauline’s songs are catchier than they have any right to be, and I had them stuck in my head long after I put the game down.\nDonkey Kong Bananaza\nis, quite simply, Nintendo at its best.\n— N.I.\n$67 at Amazon\nExplore More Buying Options\n$70 at Macy's\n$70 at Target\nNintendo\nThe Legend of Zelda: Breath of the Wild — Switch 2 edition\nAs a launch title for the original Switch,\nThe Legend of Zelda: Breath of the Wild\nwas a massive critical and commercial success for Nintendo. It shook up the formula the series had largely stuck to for decades, gave players a massive version of Hyrule to explore and an endless variety of ways to tackle the game’s challenges. But even when it came out in 2017, it was clear that\nBreath of the Wild\nwas pushing the Switch’s modest hardware to the limit. Framerates could often drop below 30, the game maxed out at 1080p resolution and load times were rather long.\nFor\nBreath of the Wild\naficionados and new players alike, the Switch 2 edition of this classic is definitely worth your time. The framerate is essentially locked at 60fps and that makes a massive difference in how fluid the game feels. It can also run in up to 4K resolution when the Switch 2 is docked. And while the game’s art style is such that extreme fidelity isn’t always obvious, there’s no doubt it looks better overall. Faster load times when jumping in and out of shrines is also a major quality of life upgrade.\nOne of the coolest things about\nBreath of the Wild\nfor the Switch 2 is the companion Zelda Notes tool. It’s part of the Switch smartphone app and lets you do things like turn on navigation to find shrines and other landmarks around Hyrule, as well as fun tidbits like voice memories for various locations and daily bonuses like free meals or weapon durability restores. The Switch 2 edition of\nBreath of the Wild\nis a $10 upgrade if you own the base game, but it’s free for anyone who subscribes to the $50 / year Nintendo Switch Online + Expansion Park service.\n— N.I.\n$69 at Amazon\nExplore More Buying Options\n$70 at Target\n$90 at Macy's\nNintendo\nThe Legend of Zelda: Tears of the Kingdom — Switch 2 edition\nWith\nTears of the Kingdom\n, Nintendo managed to follow up the reinvention of the Zelda series with a game that added more to discover and more to play with, and it even throws in a mystical LEGO kit. Link soon discovers Ultrahand, which lets you grab and stick objects, batteries, engines, weapons, food (and more) to other objects. It’s the standout addition compared to its predecessor; a creative toolbox of solutions (or foolish endeavors) to solve every puzzle, fight every beast and explore every part of\nTears of the Kingdom.\nThe Switch 2 edition adds the sort of improvements and upgrades that, arguably, warrant paying to upgrade your Switch edition. To start with, I struggled to make the frame rates choke in my current playthrough. On the original Switch, the gorgeous world of Hyrule would often stutter and slow as you transitioned between sky, surface and underground. The game’s framerates would peak at 30fps, while busy moments (or lots of custom building) could knock those rates severely.\nOn the Switch 2,\nToTK\nruns at 60fps, locked. It plays smoothly, pretty much all the time, and it’s a big improvement to what is still a beautiful adventure. The new hardware adds HDR to the graphics. This expanded dynamic range comes into its own in the underground depths sections, the low-light areas a little clearer and easier to navigate. No surprise: loading times are also quicker when fast travelling and loading the game initially.\nThere are also gameplay quality-of-life upgrades, including audio logs you can discover and listen to on the companion smartphone app and the ability to both store and share your items, weapons and ingredients. If your favorite part was crafting spinning laser death machines, et al, with your Ultrahand, the ability to save builds as QR codes and share with friends is a fun addition, if a little limited in utility at the start. You will have to manually scour the internet for creations from people who aren’t on your friends list.\nThat limitation aside, the Switch 2 edition delivers plenty for that $10 upgrade charge – and Nintendo Switch Online Expansion Pass subscribers get both\nToTK\nand\nBoTW\nupgrades for free.\n— Mat Smith, UK Bureau Chief\n$79 at Amazon\nExplore More Buying Options\n$80 at Target\n$80 at Best Buy\nShin'en Multimedia\nFast Fusion\nFast Fusion\nis a sci-fi arcade racer that wears its influences proudly. It loves\nWipeout\nand the 3D\nF-Zero\ngames, and it wants little more than to bring their ideas into modern times. Fortunately, those games ruled, so there are much worse inspirations to rip from.\nThe key to\nFast Fusion\nis right in the title: It is seriously fast, and it commits to that feeling of speed with every choice it makes. Whooshing lines drag from the back of your hard-angled ship, its engine wheezing, the background perpetually blurred. You and your opponents cut through the air like hands out the window of a speeding car. Gloriously, you can jump, sometimes skipping turns entirely, other times launching yourself into a fiery wreck. An\nIkaruga\n-esque mechanic has you quickly match the color of your craft to the many boost pads littered around each course, and there’s a boost meter you can keep topped up by taking the right line through a given section. Do it all right, and you can complete whole races without ever slowing down. Miss a few, and you’re playing a game of resource management at 500 miles per hour.\nThere’s pretty much no continuity between each track: One race you’re dashing through a forest like it’s\nReturn of the Jedi\n; the next you’re dodging tornadoes on a stormy highway. But they are spectacles, and crucially, they give you the space to maintain your speed, with few super-tight turns thrown in your way. When there is an obstacle to dodge — a giant rotating fan, crashing logs — you tend to just whiz by, furthering the sense of walking a tightrope. It all adds up to a racer that, like its spiritual predecessors, keeps you constantly engaged. For $15, it’s a pretty good deal too. Just note that there’s no online multiplayer. —\nJeff Dunn, Senior Reporter\n$15 at GameStop\nNintendo\nSuper Mario Odyssey\nWith\nDK taking center stage in the Switch 2's first AAA platformer\n, that means we're going to have to wait a bit longer for a new mainline Mario game (\nMario Kart World\ndoesn't count). But you know that? That's ok, because\nSuper Mario Odyssey\nis still an all-time great title even among an already star-studded franchise.\nIt has one of the best soundtracks of any Mario game (\nJump Up, Super Star\nanyone?) and some of the wildest mechanics. You want to turn Mario into a T-Rex? Sure, why not? How about a Hammer Bro or a Goomba? You got it — and that's just the start. And with levels that will take you from the city to an edible wonderland, there's no shortage of places to explore. So if somehow you've managed to skip\nSuper Mario Odyssey\nand are looking to play one of the best 3D platformers ever made, picking this up for the Switch 2 is a no-brainer. And did we mention it runs better on Nintendo's latest console, too?\n— Sam Rutherford, Senior Reporter\n$42 at Amazon\nExplore More Buying Options\n$59 at Macy's\n$60 at Target\nNintendo\nPokémon Scarlet & Pokémon Violet\nSome might have issues with its rigid level scaling or certain areas feeling a bit empty, but if\nPokémon Scarlet and Violet\nhad come out on the Switch 2 instead of the original Switch, Nintendo could have completely sidestepped one of the title's biggest issues: lackluster performance. But thanks to a free update pack for Nintendo's latest console, the game runs beautifully. Framerates are higher and more stable, draw distance is farther, monster density has been increased and textures and visuals have been optimized across the board. This is how the game was meant to be experienced all along and with an open world format, three different main storylines and over 100 new Pokémon to encounter,\nScarlet and Violet\nfeels like it's gotten a second life on the Switch 2.\n— S.R.\n$120 at Macy's\nExplore More Buying Options\n$120 at Target\n$127 at Amazon\nIO Interactive\nHitman: World of Assassination\nWorld of Assassination\nis how the\nHitman\nseries packaged together three meaty entries in the death-dealing series, with online limited-run events, celebrities and even an eventual Bond tie-in. Is it the best, smoothest way to play Hitman? No, but while the frame-rate dips when you‘re blending into the crowds at Formula 1, or hiding away in at the fashion show, it’s playable and it looks good. It’s also a good indication of the leap between the two Switch consoles: The original games ran on the Switch, but demanded cloud streaming.\nIO Interactive put so much attention into building compelling sandbox levels, and you’ll really live in stages like Dartmoor as you figure out the most delightful ways to end your target. Also: there are so many disguises.\nIf you thought three games in one is a lot, this is also the Signature Edition, which folds in even more content, levels and missions. There’s a lot to play through and if, like me, you never quite finished the trilogy, this is a portable, convenient way to wrap up Agent 47’s saga. It also gives the studio plenty of time to refine performance on the Switch 2 ahead of its big Bond title,\n007 First Light. — M.S.\n$60 at Amazon\nExplore More Buying Options\n$60 at Target\n$64 at Macy's\nCD Projekt\nCyberpunk 2077\nCyberpunk 2077\ncertainly isn't the newest game on this list, but the idea of porting this game over to the original Switch and its outdated hardware is so laughable, CD Projekt Red probably didn't even try. But that's what makes seeing it run on the Switch 2 so impressive. Sure, if you do some serious pixel peeping, you might notice where some graphics don't look quite as good as they would on a high-end PC or PS5. But getting the game to run as smoothly as it does on a system that you can bring pretty much anywhere is no small feat. Plus, the Ultimate Edition version of the game includes the Phantom Liberty expansion, which means you'll have well over a hundred hours of sci-fi RPG ruckus to engage in.\n— S.R.\n$69 at Amazon\nExplore More Buying Options\n$70 at Best Buy\nCheck out our entire\nBest Games series\nincluding the\nbest Nintendo Switch games\n, the\nbest PS5 games\n, the\nbest Xbox games\n, the\nbest PC games\nand the\nbest free games\nyou can play today.\nAdvertisement\nAbout our ads"
    }
]