[{"date": "2025-08-12", "URL": "https://techcrunch.com/2025/08/11/prontos-10-minute-house-help-pitch-sparked-a-3-6x-valuation-jump-in-just-90-days/", "topic": "Pronto’s 10-minute house help pitch sparked a 3.6x valuation jump in just 90 days", "source": "In 2025, the average urban Indian no longer needs to wait very long for much (except at government offices and in traffic): They simply have to order what they need from an app, and it’ll be delivered within minutes. The explosion of quick-commerce in the country has meant that millions of Indians are getting increasingly used to not having to wait for deliveries, or step out of their homes, as startups vie to make almost everything, from food and groceries to smartphones and gaming consoles, available within minutes. It seems investors, too, don’t want to wait long: A budding startup out of New Delhi called Pronto, which lets users book and avail cleaning, laundry and home services within 10 minutes, has tripled its valuation in less than 90 days. It was only in May when Pronto raised a $2 million seed round at a $12.5 million valuation. The startup has now raised an $11 million Series A round at a post-money valuation of $45 million, co-led by General Catalyst and Glade Brook Capital. Existing investor Bain Capital Ventures also participated in this round. The new funding comes in the wake of solid traction: Pronto claims its revenue has risen by nearly five times, founder and CEO Anjali Sardana told TechCrunch, since it came out of stealth barely three months ago. The startup now has bookings numbering in the ‘four-digits’ every day, and expects annual recurring revenue in the range of $750,000 to $1.5 million, Sardana said, though she declined to disclose exact figures. Pronto founder and CEO Anjali Sardana with workers Image Credits: Pronto ‘It largely comes down to two things: one being momentum and the insane speed at which we were scaling, as well as just investors recognizing the quality of the team and how fast we were executing,’ Sardana said, explaining what led investors to fund the Series A so soon after its seed round. For investors, Sardana seems to be the primary reason they bet this early. ‘We were very impressed by Anjali’s clarity of thought and execution,’ said Anand Chandrasekaran, a partner at General Catalyst, in a prepared statement. ‘The market for at-home services is massive but also very nuanced. We believe that Anjali and the team have the right vision and approach to build a generational company in this space.’", "summary": "Pronto, a New Delhi-based startup, offers home services like cleaning and laundry within 10 minutes. The company's rapid growth and strong momentum have attracted significant investor interest, leading to an $11 million Series A funding round at a $45 million valuation, just 90 days after its initial seed round. This surge is attributed to the team's execution and the massive market potential.", "questions": ["What services does the startup Pronto provide?", "How much funding did Pronto raise in its Series A round?", "What is the key factor driving investor confidence in Pronto?"]}, {"date": "2025-08-12", "URL": "https://venturebeat.com/ai/td-securities-taps-layer-6-and-openai-to-deliver-real-time-equity-insights-to-sales-and-trading-teams/", "topic": "TD Securities taps Layer 6 and OpenAI to deliver real-time equity insights to sales and trading teams", "source": "Despite being a highly regulated industry, equity trading has consistently been at the forefront of technological innovations in the financial services sector. However, when it comes to agents and AI applications, many banks have taken a more cautious approach to adoption. TD Securities, the equity and securities trading arm of TD Bank, rolled out its TD AI Virtual Assistant on July 8, aimed toward its front office institutional sales, trading and research professionals to help them manage their workflow. TD Securities CIO Dan Bosman told VentureBeat that the virtual assistant’s primary goal is to help front-office equity sales and traders gain client insights and research. ‘The first version of this began as a pilot, which we then subsequently scaled,’ Bosman said. ‘It’s really about accessing that equity research data that our analysts put out and bringing it to the hands of the sales team in a way that’s sales-friendly.’ Bosman noted that being around a trading floor means being exposed to a lot of the lingo, and the context in which users ask some questions feels very unique. So the AI assistant has to sound natural, intuitive and access the insights generated by traders. Building TD AI Bosman said the idea for the AI assistant came from a member of the equity sales team. Fortunately, the bank has a platform called TD Invent, where employees can bring ideas and the innovation leadership team can help them build out their concepts. The AI assistant was one of the ideas that came out of that platform.", "summary": "TD Securities has launched the 'TD AI Virtual Assistant' for its front-office sales, trading, and research teams. Developed in partnership with Layer 6 and OpenAI, the tool provides real-time access to equity research and client insights. The primary goal is to deliver data in an intuitive, sales-friendly format, helping professionals manage their workflow more efficiently in the fast-paced trading environment.", "questions": ["What is the purpose of the TD AI Virtual Assistant?", "Which companies did TD Securities partner with to develop the AI assistant?", "Who are the primary users of this new AI tool?"]}, {"date": "2025-08-12", "URL": "https://arstechnica.com/security/2025/08/high-severity-winrar-0-day-exploited-for-weeks-by-2-groups/", "topic": "High-severity WinRAR 0-day exploited for weeks by 2 groups", "source": "A high-severity zero-day in the widely used WinRAR file compressor is under active exploitation by two Russian cybercrime groups. The attacks backdoor computers that open malicious archives attached to phishing messages, some of which are personalized. Security firm ESET said Monday that it first detected the attacks on July 18, when its telemetry spotted a file in an unusual directory path. By July 24, ESET determined that the behavior was linked to the exploitation of an unknown vulnerability in WinRAR, a utility for compressing files and has an installed base of about 500 million. ESET notified WinRAR developers the same day, and a fix was released six days later. Serious effort and resources The vulnerability seemed to have super Windows powers. It abused alternate data streams, a Windows feature that allows different ways of representing the same file path. The exploit abused that feature to trigger a previously unknown path traversal flaw that caused WinRAR to plant malicious executables in attacker-chosen files paths %TEMP% and %LOCALAPPDATA%, which Windows normally makes off-limits because of their ability to execute code. ESET said it has determined that the attacks came from RomCom, its tracking designation for a financially motivated crime group operating out of Russia. The well-resourced group has been active for years in attacks that showcase its ability to procure exploits and execute fairly sophisticated tradecraft. The zero-day the group used is now being tracked as CVE-2025-35961.", "summary": "A critical zero-day vulnerability in the WinRAR file compression utility was actively exploited for weeks by two Russian cybercrime groups, including the financially motivated group RomCom. The flaw (CVE-2025-35961) allowed attackers to execute malicious code and backdoor computers when users opened a specially crafted archive file. Security firm ESET detected the attacks and notified WinRAR developers, who have since released a patch.", "questions": ["What was the nature of the WinRAR vulnerability?", "Which group was identified as exploiting this zero-day flaw?", "How was the vulnerability triggered by the attackers?"]}, {"date": "2025-08-12", "URL": "https://www.techradar.com/pro/baffled-by-chatgpt-and-copilot-it-might-not-be-your-fault-report-flags-the-key-skills-needed-to-get-the-most-out-of-ai", "topic": "Baffled by ChatGPT and Copilot? It might not be your fault - report flags the key skills needed to get the most out of AI", "source": "As AI tools become more and more embedded in our everyday work, new research claims the challenge of not getting the best out of them may not lie solely with the technology. A report from Multiverse has identified thirteen core human skillsets which could determine whether companies fully realize AI’s potential. The study warns without deliberate attention to these capabilities, investment in AI writer systems, LLM applications, and other AI tools could fall short of expectations. Critical thinking under pressure The Multiverse study draws from observation of AI users at varying experience levels, from beginners to experts, employing methods such as the Think Aloud Protocol Analysis. Participants verbalised their thought processes while using AI to complete real-world tasks. From this, researchers built a framework grouping the identified skills into four categories: cognitive skills, responsible AI skills, self-management, and communication skills. Among the cognitive abilities, analytical reasoning, creativity, and systems thinking were found to be essential for evaluating AI outputs, pushing innovation, and predicting AI responses.", "summary": "A report from Multiverse argues that the effective use of AI tools like ChatGPT and Copilot hinges on human skills, not just the technology itself. The study identified 13 core capabilities, grouped into four categories: cognitive skills, responsible AI, self-management, and communication. These skills, such as analytical reasoning and creativity, are deemed essential for companies to fully realize their investments in AI and avoid disappointing results.", "questions": ["What is the main argument of the Multiverse report regarding AI adoption?", "What are the four categories of skills identified in the report?", "How did the researchers identify these essential skills?"]}, {"date": "2025-08-12", "URL": "https://www.theverge.com/tesla/757594/tesla-cybertruck-deactivated-viral-video-fake", "topic": "That viral video of a ‘deactivated’ Tesla Cybertruck is a fake", "source": "Did Tesla remotely deactivate a Cybertruck in the middle of a highway because the owner featured it in an unauthorized music video? The story already seemed highly unlikely, and on Monday afternoon, Tesla tweeted about the video, saying, ‘This is fake – that’s not our screen. Tesla does NOT disable vehicles remotely.’ On Sunday, Instagram user @bighuey313 posted a video of his supposed deactivated Cybertruck, complete with a flashing red warning message on the truck’s main touchscreen. ‘Dog wtf my cybertruck just shut off on the freeway! 😡’ he wrote in the caption. ‘Almost just crashed wtf @teslamotors.’ Image: Screen grab from Instagram user @bighuey313 The video quickly went viral on social media, racking up millions of views and stoking fears that Tesla could just turn off its vehicles at a moment’s notice. But there were some obvious discrepancies, including the fact that the warning message was clearly a video playing on the screen and not a native OS-level notification. The truck’s gear was also still in ‘Drive,’ which wouldn’t be the case if the vehicle was actually deactivated.", "summary": "A viral video showing a Tesla Cybertruck supposedly being remotely deactivated on a highway has been confirmed as fake. Tesla officially debunked the video on Twitter, stating that the warning message displayed on the vehicle's screen was not a genuine system notification and that the company does not remotely disable its vehicles. Discrepancies in the video, such as the truck still being in 'Drive', also indicated it was a hoax.", "questions": ["What did the viral video claim about the Tesla Cybertruck?", "How did Tesla respond to the video?", "What was the key evidence that the video was fake, according to Tesla?"]}]